_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
block1_conv1 (Conv2D)        (None, 200, 200, 32)      896       
_________________________________________________________________
activation_1 (Activation)    (None, 200, 200, 32)      0         
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 100, 100, 32)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 100, 100, 64)      18496     
_________________________________________________________________
activation_2 (Activation)    (None, 100, 100, 64)      0         
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 50, 50, 64)        0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 50, 50, 128)       73856     
_________________________________________________________________
activation_3 (Activation)    (None, 50, 50, 128)       0         
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 25, 25, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 80000)             0         
_________________________________________________________________
fc1 (Dense)                  (None, 64)                5120064   
_________________________________________________________________
activation_4 (Activation)    (None, 64)                0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
_________________________________________________________________
activation_5 (Activation)    (None, 1)                 0         
=================================================================
Total params: 5,213,377
Trainable params: 5,213,377
Non-trainable params: 0
_________________________________________________________________
