_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
block1_conv1 (Conv2D)        (None, 200, 200, 32)      896       
_________________________________________________________________
batch_normalization_1 (Batch (None, 200, 200, 32)      128       
_________________________________________________________________
gaussian_noise_1 (GaussianNo (None, 200, 200, 32)      0         
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 100, 100, 32)      0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 100, 100, 64)      18496     
_________________________________________________________________
batch_normalization_2 (Batch (None, 100, 100, 64)      256       
_________________________________________________________________
gaussian_noise_2 (GaussianNo (None, 100, 100, 64)      0         
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 50, 50, 64)        0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 50, 50, 128)       73856     
_________________________________________________________________
batch_normalization_3 (Batch (None, 50, 50, 128)       512       
_________________________________________________________________
gaussian_noise_3 (GaussianNo (None, 50, 50, 128)       0         
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 25, 25, 128)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 25, 25, 256)       295168    
_________________________________________________________________
batch_normalization_4 (Batch (None, 25, 25, 256)       1024      
_________________________________________________________________
gaussian_noise_4 (GaussianNo (None, 25, 25, 256)       0         
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 12, 12, 256)       0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 12, 12, 512)       1180160   
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 12, 512)       2048      
_________________________________________________________________
gaussian_noise_5 (GaussianNo (None, 12, 12, 512)       0         
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 6, 6, 512)         0         
_________________________________________________________________
block6_conv1 (Conv2D)        (None, 6, 6, 512)         2359808   
_________________________________________________________________
batch_normalization_6 (Batch (None, 6, 6, 512)         2048      
_________________________________________________________________
gaussian_noise_6 (GaussianNo (None, 6, 6, 512)         0         
_________________________________________________________________
block6_pool (MaxPooling2D)   (None, 3, 3, 512)         0         
_________________________________________________________________
block7_conv1 (Conv2D)        (None, 3, 3, 512)         2359808   
_________________________________________________________________
batch_normalization_7 (Batch (None, 3, 3, 512)         2048      
_________________________________________________________________
gaussian_noise_7 (GaussianNo (None, 3, 3, 512)         0         
_________________________________________________________________
block7_pool (MaxPooling2D)   (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
fc1 (Dense)                  (None, 512)               262656    
_________________________________________________________________
predictions (Dense)          (None, 2)                 1026      
=================================================================
Total params: 6,559,938
Trainable params: 6,555,906
Non-trainable params: 4,032
_________________________________________________________________
